MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC1401-F064F0064/mcu.h
/* ---------------------------------  LEDTS2_EVFR  -------------------------------- */
#define LEDTS2_EVFR_TSF_Pos                   (0UL)                     /*!< LEDTS2 EVFR: TSF (Bit 0)                                    */
#define LEDTS2_EVFR_TSF_Msk                   (0x1UL)                   /*!< LEDTS2 EVFR: TSF (Bitfield-Mask: 0x01)                      */
#define LEDTS2_EVFR_TFF_Pos                   (1UL)                     /*!< LEDTS2 EVFR: TFF (Bit 1)                                    */
#define LEDTS2_EVFR_TFF_Msk                   (0x2UL)                   /*!< LEDTS2 EVFR: TFF (Bitfield-Mask: 0x01)                      */
#define LEDTS2_EVFR_TPF_Pos                   (2UL)                     /*!< LEDTS2 EVFR: TPF (Bit 2)                                    */
#define LEDTS2_EVFR_TPF_Msk                   (0x4UL)                   /*!< LEDTS2 EVFR: TPF (Bitfield-Mask: 0x01)                      */
#define LEDTS2_EVFR_TSCTROVF_Pos              (3UL)                     /*!< LEDTS2 EVFR: TSCTROVF (Bit 3)                               */
#define LEDTS2_EVFR_TSCTROVF_Msk              (0x8UL)                   /*!< LEDTS2 EVFR: TSCTROVF (Bitfield-Mask: 0x01)                 */
#define LEDTS2_EVFR_CTSF_Pos                  (16UL)                    /*!< LEDTS2 EVFR: CTSF (Bit 16)                                  */
#define LEDTS2_EVFR_CTSF_Msk                  (0x10000UL)               /*!< LEDTS2 EVFR: CTSF (Bitfield-Mask: 0x01)                     */
#define LEDTS2_EVFR_CTFF_Pos                  (17UL)                    /*!< LEDTS2 EVFR: CTFF (Bit 17)                                  */
#define LEDTS2_EVFR_CTFF_Msk                  (0x20000UL)               /*!< LEDTS2 EVFR: CTFF (Bitfield-Mask: 0x01)                     */
#define LEDTS2_EVFR_CTPF_Pos                  (18UL)                    /*!< LEDTS2 EVFR: CTPF (Bit 18)                                  */
#define LEDTS2_EVFR_CTPF_Msk                  (0x40000UL)               /*!< LEDTS2 EVFR: CTPF (Bitfield-Mask: 0x01)                     */

/* --------------------------------  LEDTS2_TSVAL  -------------------------------- */
#define LEDTS2_TSVAL_TSCTRVALR_Pos            (0UL)                     /*!< LEDTS2 TSVAL: TSCTRVALR (Bit 0)                             */
#define LEDTS2_TSVAL_TSCTRVALR_Msk            (0xffffUL)                /*!< LEDTS2 TSVAL: TSCTRVALR (Bitfield-Mask: 0xffff)             */
#define LEDTS2_TSVAL_TSCTRVAL_Pos             (16UL)                    /*!< LEDTS2 TSVAL: TSCTRVAL (Bit 16)                             */
#define LEDTS2_TSVAL_TSCTRVAL_Msk             (0xffff0000UL)            /*!< LEDTS2 TSVAL: TSCTRVAL (Bitfield-Mask: 0xffff)              */

/* --------------------------------  LEDTS2_LINE0  -------------------------------- */
#define LEDTS2_LINE0_LINE_0_Pos               (0UL)                     /*!< LEDTS2 LINE0: LINE_0 (Bit 0)                                */
#define LEDTS2_LINE0_LINE_0_Msk               (0xffUL)                  /*!< LEDTS2 LINE0: LINE_0 (Bitfield-Mask: 0xff)                  */
#define LEDTS2_LINE0_LINE_1_Pos               (8UL)                     /*!< LEDTS2 LINE0: LINE_1 (Bit 8)                                */
#define LEDTS2_LINE0_LINE_1_Msk               (0xff00UL)                /*!< LEDTS2 LINE0: LINE_1 (Bitfield-Mask: 0xff)                  */
#define LEDTS2_LINE0_LINE_2_Pos               (16UL)                    /*!< LEDTS2 LINE0: LINE_2 (Bit 16)                               */
#define LEDTS2_LINE0_LINE_2_Msk               (0xff0000UL)              /*!< LEDTS2 LINE0: LINE_2 (Bitfield-Mask: 0xff)                  */
#define LEDTS2_LINE0_LINE_3_Pos               (24UL)                    /*!< LEDTS2 LINE0: LINE_3 (Bit 24)                               */
#define LEDTS2_LINE0_LINE_3_Msk               (0xff000000UL)            /*!< LEDTS2 LINE0: LINE_3 (Bitfield-Mask: 0xff)                  */

/* --------------------------------  LEDTS2_LINE1  -------------------------------- */
#define LEDTS2_LINE1_LINE_4_Pos               (0UL)                     /*!< LEDTS2 LINE1: LINE_4 (Bit 0)                                */
#define LEDTS2_LINE1_LINE_4_Msk               (0xffUL)                  /*!< LEDTS2 LINE1: LINE_4 (Bitfield-Mask: 0xff)                  */
#define LEDTS2_LINE1_LINE_5_Pos               (8UL)                     /*!< LEDTS2 LINE1: LINE_5 (Bit 8)                                */
#define LEDTS2_LINE1_LINE_5_Msk               (0xff00UL)                /*!< LEDTS2 LINE1: LINE_5 (Bitfield-Mask: 0xff)                  */
#define LEDTS2_LINE1_LINE_6_Pos               (16UL)                    /*!< LEDTS2 LINE1: LINE_6 (Bit 16)                               */
#define LEDTS2_LINE1_LINE_6_Msk               (0xff0000UL)              /*!< LEDTS2 LINE1: LINE_6 (Bitfield-Mask: 0xff)                  */
#define LEDTS2_LINE1_LINE_A_Pos               (24UL)                    /*!< LEDTS2 LINE1: LINE_A (Bit 24)                               */
#define LEDTS2_LINE1_LINE_A_Msk               (0xff000000UL)            /*!< LEDTS2 LINE1: LINE_A (Bitfield-Mask: 0xff)                  */

/* --------------------------------  LEDTS2_LDCMP0  ------------------------------- */
#define LEDTS2_LDCMP0_CMP_LD0_Pos             (0UL)                     /*!< LEDTS2 LDCMP0: CMP_LD0 (Bit 0)                              */
#define LEDTS2_LDCMP0_CMP_LD0_Msk             (0xffUL)                  /*!< LEDTS2 LDCMP0: CMP_LD0 (Bitfield-Mask: 0xff)                */
#define LEDTS2_LDCMP0_CMP_LD1_Pos             (8UL)                     /*!< LEDTS2 LDCMP0: CMP_LD1 (Bit 8)                              */
#define LEDTS2_LDCMP0_CMP_LD1_Msk             (0xff00UL)                /*!< LEDTS2 LDCMP0: CMP_LD1 (Bitfield-Mask: 0xff)                */
#define LEDTS2_LDCMP0_CMP_LD2_Pos             (16UL)                    /*!< LEDTS2 LDCMP0: CMP_LD2 (Bit 16)                             */
#define LEDTS2_LDCMP0_CMP_LD2_Msk             (0xff0000UL)              /*!< LEDTS2 LDCMP0: CMP_LD2 (Bitfield-Mask: 0xff)                */
#define LEDTS2_LDCMP0_CMP_LD3_Pos             (24UL)                    /*!< LEDTS2 LDCMP0: CMP_LD3 (Bit 24)                             */
#define LEDTS2_LDCMP0_CMP_LD3_Msk             (0xff000000UL)            /*!< LEDTS2 LDCMP0: CMP_LD3 (Bitfield-Mask: 0xff)                */

/* --------------------------------  LEDTS2_LDCMP1  ------------------------------- */
#define LEDTS2_LDCMP1_CMP_LD4_Pos             (0UL)                     /*!< LEDTS2 LDCMP1: CMP_LD4 (Bit 0)                              */
#define LEDTS2_LDCMP1_CMP_LD4_Msk             (0xffUL)                  /*!< LEDTS2 LDCMP1: CMP_LD4 (Bitfield-Mask: 0xff)                */
#define LEDTS2_LDCMP1_CMP_LD5_Pos             (8UL)                     /*!< LEDTS2 LDCMP1: CMP_LD5 (Bit 8)                              */
#define LEDTS2_LDCMP1_CMP_LD5_Msk             (0xff00UL)                /*!< LEDTS2 LDCMP1: CMP_LD5 (Bitfield-Mask: 0xff)                */
#define LEDTS2_LDCMP1_CMP_LD6_Pos             (16UL)                    /*!< LEDTS2 LDCMP1: CMP_LD6 (Bit 16)                             */
#define LEDTS2_LDCMP1_CMP_LD6_Msk             (0xff0000UL)              /*!< LEDTS2 LDCMP1: CMP_LD6 (Bitfield-Mask: 0xff)                */
#define LEDTS2_LDCMP1_CMP_LDA_TSCOM_Pos       (24UL)                    /*!< LEDTS2 LDCMP1: CMP_LDA_TSCOM (Bit 24)                       */
#define LEDTS2_LDCMP1_CMP_LDA_TSCOM_Msk       (0xff000000UL)            /*!< LEDTS2 LDCMP1: CMP_LDA_TSCOM (Bitfield-Mask: 0xff)          */

/* --------------------------------  LEDTS2_TSCMP0  ------------------------------- */
#define LEDTS2_TSCMP0_CMP_TS0_Pos             (0UL)                     /*!< LEDTS2 TSCMP0: CMP_TS0 (Bit 0)                              */
#define LEDTS2_TSCMP0_CMP_TS0_Msk             (0xffUL)                  /*!< LEDTS2 TSCMP0: CMP_TS0 (Bitfield-Mask: 0xff)                */
#define LEDTS2_TSCMP0_CMP_TS1_Pos             (8UL)                     /*!< LEDTS2 TSCMP0: CMP_TS1 (Bit 8)                              */
#define LEDTS2_TSCMP0_CMP_TS1_Msk             (0xff00UL)                /*!< LEDTS2 TSCMP0: CMP_TS1 (Bitfield-Mask: 0xff)                */
#define LEDTS2_TSCMP0_CMP_TS2_Pos             (16UL)                    /*!< LEDTS2 TSCMP0: CMP_TS2 (Bit 16)                             */
#define LEDTS2_TSCMP0_CMP_TS2_Msk             (0xff0000UL)              /*!< LEDTS2 TSCMP0: CMP_TS2 (Bitfield-Mask: 0xff)                */
#define LEDTS2_TSCMP0_CMP_TS3_Pos             (24UL)                    /*!< LEDTS2 TSCMP0: CMP_TS3 (Bit 24)                             */
#define LEDTS2_TSCMP0_CMP_TS3_Msk             (0xff000000UL)            /*!< LEDTS2 TSCMP0: CMP_TS3 (Bitfield-Mask: 0xff)                */

