MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC1401-F064F0064/mcu.h
/* -----------------------------  COMPARATOR_ANACMP0  ----------------------------- */
#define COMPARATOR_ANACMP0_CMP_EN_Pos         (0UL)                     /*!< COMPARATOR ANACMP0: CMP_EN (Bit 0)                          */
#define COMPARATOR_ANACMP0_CMP_EN_Msk         (0x1UL)                   /*!< COMPARATOR ANACMP0: CMP_EN (Bitfield-Mask: 0x01)            */
#define COMPARATOR_ANACMP0_CMP_FLT_OFF_Pos    (1UL)                     /*!< COMPARATOR ANACMP0: CMP_FLT_OFF (Bit 1)                     */
#define COMPARATOR_ANACMP0_CMP_FLT_OFF_Msk    (0x2UL)                   /*!< COMPARATOR ANACMP0: CMP_FLT_OFF (Bitfield-Mask: 0x01)       */
#define COMPARATOR_ANACMP0_CMP_INV_OUT_Pos    (3UL)                     /*!< COMPARATOR ANACMP0: CMP_INV_OUT (Bit 3)                     */
#define COMPARATOR_ANACMP0_CMP_INV_OUT_Msk    (0x8UL)                   /*!< COMPARATOR ANACMP0: CMP_INV_OUT (Bitfield-Mask: 0x01)       */
#define COMPARATOR_ANACMP0_CMP_HYST_ADJ_Pos   (4UL)                     /*!< COMPARATOR ANACMP0: CMP_HYST_ADJ (Bit 4)                    */
#define COMPARATOR_ANACMP0_CMP_HYST_ADJ_Msk   (0x30UL)                  /*!< COMPARATOR ANACMP0: CMP_HYST_ADJ (Bitfield-Mask: 0x03)      */
#define COMPARATOR_ANACMP0_ACMP0_SEL_Pos      (6UL)                     /*!< COMPARATOR ANACMP0: ACMP0_SEL (Bit 6)                       */
#define COMPARATOR_ANACMP0_ACMP0_SEL_Msk      (0x40UL)                  /*!< COMPARATOR ANACMP0: ACMP0_SEL (Bitfield-Mask: 0x01)         */
#define COMPARATOR_ANACMP0_CMP_LPWR_Pos       (8UL)                     /*!< COMPARATOR ANACMP0: CMP_LPWR (Bit 8)                        */
#define COMPARATOR_ANACMP0_CMP_LPWR_Msk       (0x100UL)                 /*!< COMPARATOR ANACMP0: CMP_LPWR (Bitfield-Mask: 0x01)          */
#define COMPARATOR_ANACMP0_CMP_OUT_Pos        (15UL)                    /*!< COMPARATOR ANACMP0: CMP_OUT (Bit 15)                        */
#define COMPARATOR_ANACMP0_CMP_OUT_Msk        (0x8000UL)                /*!< COMPARATOR ANACMP0: CMP_OUT (Bitfield-Mask: 0x01)           */

/* -----------------------------  COMPARATOR_ANACMP1  ----------------------------- */
#define COMPARATOR_ANACMP1_CMP_EN_Pos         (0UL)                     /*!< COMPARATOR ANACMP1: CMP_EN (Bit 0)                          */
#define COMPARATOR_ANACMP1_CMP_EN_Msk         (0x1UL)                   /*!< COMPARATOR ANACMP1: CMP_EN (Bitfield-Mask: 0x01)            */
#define COMPARATOR_ANACMP1_CMP_FLT_OFF_Pos    (1UL)                     /*!< COMPARATOR ANACMP1: CMP_FLT_OFF (Bit 1)                     */
#define COMPARATOR_ANACMP1_CMP_FLT_OFF_Msk    (0x2UL)                   /*!< COMPARATOR ANACMP1: CMP_FLT_OFF (Bitfield-Mask: 0x01)       */
#define COMPARATOR_ANACMP1_CMP_INV_OUT_Pos    (3UL)                     /*!< COMPARATOR ANACMP1: CMP_INV_OUT (Bit 3)                     */
#define COMPARATOR_ANACMP1_CMP_INV_OUT_Msk    (0x8UL)                   /*!< COMPARATOR ANACMP1: CMP_INV_OUT (Bitfield-Mask: 0x01)       */
#define COMPARATOR_ANACMP1_CMP_HYST_ADJ_Pos   (4UL)                     /*!< COMPARATOR ANACMP1: CMP_HYST_ADJ (Bit 4)                    */
#define COMPARATOR_ANACMP1_CMP_HYST_ADJ_Msk   (0x30UL)                  /*!< COMPARATOR ANACMP1: CMP_HYST_ADJ (Bitfield-Mask: 0x03)      */
#define COMPARATOR_ANACMP1_REF_DIV_EN_Pos     (6UL)                     /*!< COMPARATOR ANACMP1: REF_DIV_EN (Bit 6)                      */
#define COMPARATOR_ANACMP1_REF_DIV_EN_Msk     (0x40UL)                  /*!< COMPARATOR ANACMP1: REF_DIV_EN (Bitfield-Mask: 0x01)        */
#define COMPARATOR_ANACMP1_CMP_OUT_Pos        (15UL)                    /*!< COMPARATOR ANACMP1: CMP_OUT (Bit 15)                        */
#define COMPARATOR_ANACMP1_CMP_OUT_Msk        (0x8000UL)                /*!< COMPARATOR ANACMP1: CMP_OUT (Bitfield-Mask: 0x01)           */

/* -----------------------------  COMPARATOR_ANACMP2  ----------------------------- */
#define COMPARATOR_ANACMP2_CMP_EN_Pos         (0UL)                     /*!< COMPARATOR ANACMP2: CMP_EN (Bit 0)                          */
#define COMPARATOR_ANACMP2_CMP_EN_Msk         (0x1UL)                   /*!< COMPARATOR ANACMP2: CMP_EN (Bitfield-Mask: 0x01)            */
#define COMPARATOR_ANACMP2_CMP_FLT_OFF_Pos    (1UL)                     /*!< COMPARATOR ANACMP2: CMP_FLT_OFF (Bit 1)                     */
#define COMPARATOR_ANACMP2_CMP_FLT_OFF_Msk    (0x2UL)                   /*!< COMPARATOR ANACMP2: CMP_FLT_OFF (Bitfield-Mask: 0x01)       */
#define COMPARATOR_ANACMP2_CMP_INV_OUT_Pos    (3UL)                     /*!< COMPARATOR ANACMP2: CMP_INV_OUT (Bit 3)                     */
#define COMPARATOR_ANACMP2_CMP_INV_OUT_Msk    (0x8UL)                   /*!< COMPARATOR ANACMP2: CMP_INV_OUT (Bitfield-Mask: 0x01)       */
#define COMPARATOR_ANACMP2_CMP_HYST_ADJ_Pos   (4UL)                     /*!< COMPARATOR ANACMP2: CMP_HYST_ADJ (Bit 4)                    */
#define COMPARATOR_ANACMP2_CMP_HYST_ADJ_Msk   (0x30UL)                  /*!< COMPARATOR ANACMP2: CMP_HYST_ADJ (Bitfield-Mask: 0x03)      */
#define COMPARATOR_ANACMP2_ACMP2_SEL_Pos      (6UL)                     /*!< COMPARATOR ANACMP2: ACMP2_SEL (Bit 6)                       */
#define COMPARATOR_ANACMP2_ACMP2_SEL_Msk      (0x40UL)                  /*!< COMPARATOR ANACMP2: ACMP2_SEL (Bitfield-Mask: 0x01)         */
#define COMPARATOR_ANACMP2_CMP_OUT_Pos        (15UL)                    /*!< COMPARATOR ANACMP2: CMP_OUT (Bit 15)                        */
#define COMPARATOR_ANACMP2_CMP_OUT_Msk        (0x8000UL)                /*!< COMPARATOR ANACMP2: CMP_OUT (Bitfield-Mask: 0x01)           */

/* -----------------------------  COMPARATOR_ANACMP3  ----------------------------- */
#define COMPARATOR_ANACMP3_CMP_EN_Pos         (0UL)                     /*!< COMPARATOR ANACMP3: CMP_EN (Bit 0)                          */
#define COMPARATOR_ANACMP3_CMP_EN_Msk         (0x1UL)                   /*!< COMPARATOR ANACMP3: CMP_EN (Bitfield-Mask: 0x01)            */
#define COMPARATOR_ANACMP3_CMP_FLT_OFF_Pos    (1UL)                     /*!< COMPARATOR ANACMP3: CMP_FLT_OFF (Bit 1)                     */
#define COMPARATOR_ANACMP3_CMP_FLT_OFF_Msk    (0x2UL)                   /*!< COMPARATOR ANACMP3: CMP_FLT_OFF (Bitfield-Mask: 0x01)       */
#define COMPARATOR_ANACMP3_CMP_INV_OUT_Pos    (3UL)                     /*!< COMPARATOR ANACMP3: CMP_INV_OUT (Bit 3)                     */
#define COMPARATOR_ANACMP3_CMP_INV_OUT_Msk    (0x8UL)                   /*!< COMPARATOR ANACMP3: CMP_INV_OUT (Bitfield-Mask: 0x01)       */
#define COMPARATOR_ANACMP3_CMP_HYST_ADJ_Pos   (4UL)                     /*!< COMPARATOR ANACMP3: CMP_HYST_ADJ (Bit 4)                    */
#define COMPARATOR_ANACMP3_CMP_HYST_ADJ_Msk   (0x30UL)                  /*!< COMPARATOR ANACMP3: CMP_HYST_ADJ (Bitfield-Mask: 0x03)      */
#define COMPARATOR_ANACMP3_ACMP3_SEL_Pos      (6UL)                     /*!< COMPARATOR ANACMP3: ACMP3_SEL (Bit 6)                       */
#define COMPARATOR_ANACMP3_ACMP3_SEL_Msk      (0x40UL)                  /*!< COMPARATOR ANACMP3: ACMP3_SEL (Bitfield-Mask: 0x01)         */
#define COMPARATOR_ANACMP3_CMP_OUT_Pos        (15UL)                    /*!< COMPARATOR ANACMP3: CMP_OUT (Bit 15)                        */
#define COMPARATOR_ANACMP3_CMP_OUT_Msk        (0x8000UL)                /*!< COMPARATOR ANACMP3: CMP_OUT (Bitfield-Mask: 0x01)           */


/* ================================================================================ */
/* ================       struct 'SCU_ANALOG' Position & Mask      ================ */
/* ================================================================================ */


/* ----------------------------  SCU_ANALOG_ANATSECTRL  --------------------------- */
#define SCU_ANALOG_ANATSECTRL_TSE_EN_Pos      (0UL)                     /*!< SCU_ANALOG ANATSECTRL: TSE_EN (Bit 0)                       */
#define SCU_ANALOG_ANATSECTRL_TSE_EN_Msk      (0x1UL)                   /*!< SCU_ANALOG ANATSECTRL: TSE_EN (Bitfield-Mask: 0x01)         */

/* -----------------------------  SCU_ANALOG_ANATSEIH  ---------------------------- */
#define SCU_ANALOG_ANATSEIH_TSE_IH_Pos        (0UL)                     /*!< SCU_ANALOG ANATSEIH: TSE_IH (Bit 0)                         */
#define SCU_ANALOG_ANATSEIH_TSE_IH_Msk        (0xffffUL)                /*!< SCU_ANALOG ANATSEIH: TSE_IH (Bitfield-Mask: 0xffff)         */

/* -----------------------------  SCU_ANALOG_ANATSEIL  ---------------------------- */
#define SCU_ANALOG_ANATSEIL_TSE_IL_Pos        (0UL)                     /*!< SCU_ANALOG ANATSEIL: TSE_IL (Bit 0)                         */
#define SCU_ANALOG_ANATSEIL_TSE_IL_Msk        (0xffffUL)                /*!< SCU_ANALOG ANATSEIL: TSE_IL (Bitfield-Mask: 0xffff)         */

/* ----------------------------  SCU_ANALOG_ANATSEMON  ---------------------------- */
#define SCU_ANALOG_ANATSEMON_TSE_MON_Pos      (0UL)                     /*!< SCU_ANALOG ANATSEMON: TSE_MON (Bit 0)                       */
#define SCU_ANALOG_ANATSEMON_TSE_MON_Msk      (0xffffUL)                /*!< SCU_ANALOG ANATSEMON: TSE_MON (Bitfield-Mask: 0xffff)       */

/* -----------------------------  SCU_ANALOG_ANAVDEL  ----------------------------- */
#define SCU_ANALOG_ANAVDEL_VDEL_SELECT_Pos    (0UL)                     /*!< SCU_ANALOG ANAVDEL: VDEL_SELECT (Bit 0)                     */
#define SCU_ANALOG_ANAVDEL_VDEL_SELECT_Msk    (0x3UL)                   /*!< SCU_ANALOG ANAVDEL: VDEL_SELECT (Bitfield-Mask: 0x03)       */
#define SCU_ANALOG_ANAVDEL_VDEL_TIM_ADJ_Pos   (2UL)                     /*!< SCU_ANALOG ANAVDEL: VDEL_TIM_ADJ (Bit 2)                    */
#define SCU_ANALOG_ANAVDEL_VDEL_TIM_ADJ_Msk   (0xcUL)                   /*!< SCU_ANALOG ANAVDEL: VDEL_TIM_ADJ (Bitfield-Mask: 0x03)      */
#define SCU_ANALOG_ANAVDEL_VDEL_EN_Pos        (4UL)                     /*!< SCU_ANALOG ANAVDEL: VDEL_EN (Bit 4)                         */
#define SCU_ANALOG_ANAVDEL_VDEL_EN_Msk        (0x10UL)                  /*!< SCU_ANALOG ANAVDEL: VDEL_EN (Bitfield-Mask: 0x01)           */

/* ----------------------------  SCU_ANALOG_ANAOFFSET  ---------------------------- */
#define SCU_ANALOG_ANAOFFSET_ADJL_OFFSET_Pos  (0UL)                     /*!< SCU_ANALOG ANAOFFSET: ADJL_OFFSET (Bit 0)                   */
#define SCU_ANALOG_ANAOFFSET_ADJL_OFFSET_Msk  (0x7fUL)                  /*!< SCU_ANALOG ANAOFFSET: ADJL_OFFSET (Bitfield-Mask: 0x7f)     */

/* -----------------------------  SCU_ANALOG_ANASYNC1  ---------------------------- */
#define SCU_ANALOG_ANASYNC1_SYNC_PRELOAD_Pos  (0UL)                     /*!< SCU_ANALOG ANASYNC1: SYNC_PRELOAD (Bit 0)                   */
#define SCU_ANALOG_ANASYNC1_SYNC_PRELOAD_Msk  (0x3fffUL)                /*!< SCU_ANALOG ANASYNC1: SYNC_PRELOAD (Bitfield-Mask: 0x3fff)   */
#define SCU_ANALOG_ANASYNC1_SYNC_DCO_EN_Pos   (14UL)                    /*!< SCU_ANALOG ANASYNC1: SYNC_DCO_EN (Bit 14)                   */
#define SCU_ANALOG_ANASYNC1_SYNC_DCO_EN_Msk   (0x4000UL)                /*!< SCU_ANALOG ANASYNC1: SYNC_DCO_EN (Bitfield-Mask: 0x01)      */
#define SCU_ANALOG_ANASYNC1_XTAL_SEL_Pos      (15UL)                    /*!< SCU_ANALOG ANASYNC1: XTAL_SEL (Bit 15)                      */
#define SCU_ANALOG_ANASYNC1_XTAL_SEL_Msk      (0x8000UL)                /*!< SCU_ANALOG ANASYNC1: XTAL_SEL (Bitfield-Mask: 0x01)         */

